In [1]:
import pandas as pd

In [3]:
df1=pd.DataFrame([{EmployeeID: [101, 102, 103, 104, 105],
Name: [&#39;Alice&#39;, &#39;Bob&#39;, &#39;Charlie&#39;, &#39;David&#39;, &#39;Eva&#39;],
Department: [&#39;HR&#39;, &#39;IT&#39;, &#39;Finance&#39;, &#39;IT&#39;, &#39;HR&#39;],
Salary: [50000, 60000, 55000, 65000, 58000]}])

SyntaxError: closing parenthesis '}' does not match opening parenthesis '[' on line 3 (1112570945.py, line 4)

In [5]:
df1=pd.DataFrame(EmployeeID: [101, 102, 103, 104, 105],
Name: [&#39;Alice&#39;, &#39;Bob&#39;, &#39;Charlie&#39;, &#39;David&#39;, &#39;Eva&#39;],
Department: [&#39;HR&#39;, &#39;IT&#39;, &#39;Finance&#39;, &#39;IT&#39;, &#39;HR&#39;],
Salary: [50000, 60000, 55000, 65000, 58000])

SyntaxError: closing parenthesis ')' does not match opening parenthesis '[' on line 3 (2885469936.py, line 4)

In [9]:
df=pd.DataFrame({'EmployeeID': [101, 102, 103, 104, 105],'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],'Department': ['HR', 'IT', 'Finance', 'IT', 'HR'],'Salary': [50000, 60000, 55000, 65000, 58000]})

In [11]:
df

   EmployeeID     Name Department  Salary
0         101    Alice         HR   50000
1         102      Bob         IT   60000
2         103  Charlie    Finance   55000
3         104    David         IT   65000
4         105      Eva         HR   58000

In [15]:
print(df[['Name', 'Salary']])

      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   55000
3    David   65000
4      Eva   58000

In [21]:
salary = df[df['Department'] == 'IT']['Salary']
avg_salary = salary.mean()
print(avg_salary)

62500.0

In [25]:
df['Bonus'] = df['Salary'] * 0.10
print(df)

   EmployeeID     Name Department  Salary   Bonus
0         101    Alice         HR   50000  5000.0
1         102      Bob         IT   60000  6000.0
2         103  Charlie    Finance   55000  5500.0
3         104    David         IT   65000  6500.0
4         105      Eva         HR   58000  5800.0

In [27]:
df.rename(columns={'EmployeeID': 'ID'}, inplace=True)
print(df)

    ID     Name Department  Salary   Bonus
0  101    Alice         HR   50000  5000.0
1  102      Bob         IT   60000  6000.0
2  103  Charlie    Finance   55000  5500.0
3  104    David         IT   65000  6500.0
4  105      Eva         HR   58000  5800.0

In [29]:
df.drop(columns=['Department'], inplace=True)
print(df)

    ID     Name  Salary   Bonus
0  101    Alice   50000  5000.0
1  102      Bob   60000  6000.0
2  103  Charlie   55000  5500.0
3  104    David   65000  6500.0
4  105      Eva   58000  5800.0

In [85]:
sales = pd.DataFrame({
    'Month': ['Jan', 'Feb', 'Mar', 'Apr', 'May'],
    'Product_A': [150, 200, 250, 300, 350],
    'Product_B': [300, 250, 200, 150, 100]
})

In [87]:
sales

  Month  Product_A  Product_B
0   Jan        150        300
1   Feb        200        250
2   Mar        250        200
3   Apr        300        150
4   May        350        100

In [91]:
total_sales_product_a = sales['Product_A'].sum()
total_sales_product_b = sales['Product_B'].sum()
print('Total Sales for Product_A:', total_sales_product_a)
print('Total Sales for Product_B:', total_sales_product_b)

Total Sales for Product_A: 1250
Total Sales for Product_B: 1000

In [77]:
month_max_sales_a = sales.loc[sales['Product_A'].idxmax(), 'Month']
print('Month with highest sales for Product_A:', month_max_sales_a)

Month with highest sales for Product_A: May

In [93]:
sales['Total_Sales'] = sales['Product_A'] + sales['Product_B']
print(sales)

  Month  Product_A  Product_B  Total_Sales
0   Jan        150        300          450
1   Feb        200        250          450
2   Mar        250        200          450
3   Apr        300        150          450
4   May        350        100          450

In [95]:
sales['Product_A_Normalized'] = sales['Product_A'] / sales['Product_A'].max()
print(sales)

  Month  Product_A  Product_B  Total_Sales  Product_A_Normalized
0   Jan        150        300          450              0.428571
1   Feb        200        250          450              0.571429
2   Mar        250        200          450              0.714286
3   Apr        300        150          450              0.857143
4   May        350        100          450              1.000000

In [97]:
filtered_data = sales[sales['Total_Sales'] > 400]
print(filtered_data)

  Month  Product_A  Product_B  Total_Sales  Product_A_Normalized
0   Jan        150        300          450              0.428571
1   Feb        200        250          450              0.571429
2   Mar        250        200          450              0.714286
3   Apr        300        150          450              0.857143
4   May        350        100          450              1.000000

In [99]:
customer_data = pd.DataFrame({
    'CustomerID': [1, 2, 3, 4, 5],
    'Name': ['John', 'Jane', None, 'Alice', 'Bob'],
    'Purchase': [200, 300, 150, None, 500]
})

In [101]:
missing_values = customer_data.isna().sum()
print(missing_values)

CustomerID    0
Name          1
Purchase      1
dtype: int64

In [105]:
customer_data['Name'].fillna('Unknown')
print(customer_data)

   CustomerID     Name  Purchase
0           1     John     200.0
1           2     Jane     300.0
2           3  Unknown     150.0
3           4    Alice       NaN
4           5      Bob     500.0

In [109]:
median_purchase = customer_data['Purchase'].median()
customer_data['Purchase'].fillna(median_purchase)
print(customer_data)

   CustomerID     Name  Purchase
0           1     John     200.0
1           2     Jane     300.0
2           3  Unknown     150.0
3           4    Alice     250.0
4           5      Bob     500.0

In [111]:
customer_data.dropna(inplace=True)
print(customer_data)

   CustomerID     Name  Purchase
0           1     John     200.0
1           2     Jane     300.0
2           3  Unknown     150.0
3           4    Alice     250.0
4           5      Bob     500.0

In [113]:
median_purchase = customer_data['Purchase'].median()
high_value_customers = customer_data[customer_data['Purchase'] > median_purchase]
print(high_value_customers)

   CustomerID  Name  Purchase
1           2  Jane     300.0
4           5   Bob     500.0

In [115]:
temperature = pd.Series([23, 21, 20, 25, 27, 30, 28, 22, 24, 26])

In [117]:
temperature

0    23
1    21
2    20
3    25
4    27
5    30
6    28
7    22
8    24
9    26
dtype: int64

In [119]:
mean_temp = temperature.mean()
median_temp = temperature.median()
variance_temp = temperature.var()
print('Mean:', mean_temp)
print('Median:', median_temp)
print('Variance:', variance_temp)

Mean: 24.6
Median: 24.5
Variance: 10.266666666666666

In [121]:
above_below_mean = temperature.apply(lambda x: 'Above' if x > mean_temp else 'Below')
print(above_below_mean)

0    Below
1    Below
2    Below
3    Above
4    Above
5    Above
6    Above
7    Below
8    Below
9    Above
dtype: object

In [123]:
temperature_kelvin = temperature + 273.15
print(temperature_kelvin)

0    296.15
1    294.15
2    293.15
3    298.15
4    300.15
5    303.15
6    301.15
7    295.15
8    297.15
9    299.15
dtype: float64

In [125]:
rolling_mean = temperature.rolling(window=3).mean()
print(rolling_mean)

0          NaN
1          NaN
2    21.333333
3    22.000000
4    24.000000
5    27.333333
6    28.333333
7    26.666667
8    24.666667
9    24.000000
dtype: float64

In [127]:
std_dev = temperature.std()
filtered_temps = temperature[(temperature < mean_temp - std_dev) | (temperature > mean_temp + std_dev)]
print(filtered_temps)

1    21
2    20
5    30
6    28
dtype: int64

In [129]:
orders = pd.DataFrame({
    'OrderID': [1, 2, 3, 4, 5],
    'CustomerID': [101, 102, 103, 104, 101],
    'Product': ['A', 'B', 'A', 'C', 'B'],
    'Quantity': [2, 1, 4, 2, 3]
})

customers = pd.DataFrame({
    'CustomerID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Location': ['New York', 'Los Angeles', 'Chicago', 'Houston']
})

In [131]:
merged_df = pd.merge(orders, customers, on='CustomerID')
print(merged_df)

   OrderID  CustomerID Product  Quantity     Name     Location
0        1         101       A         2    Alice     New York
1        2         102       B         1      Bob  Los Angeles
2        3         103       A         4  Charlie      Chicago
3        4         104       C         2    David      Houston
4        5         101       B         3    Alice     New York

In [133]:
quantity_by_location = merged_df.groupby('Location')['Quantity'].sum()
print(quantity_by_location)

Location
Chicago        4
Houston        2
Los Angeles    1
New York       5
Name: Quantity, dtype: int64

In [135]:
orders_count = merged_df['CustomerID'].value_counts()
top_customer_id = orders_count.idxmax()
top_customer = customers[customers['CustomerID'] == top_customer_id]
print(top_customer)

   CustomerID   Name  Location
0         101  Alice  New York

In [137]:
merged_df['Total_Quantity'] = merged_df.groupby('Product')['Quantity'].cumsum()
print(merged_df)

   OrderID  CustomerID Product  Quantity     Name     Location  Total_Quantity
0        1         101       A         2    Alice     New York               2
1        2         102       B         1      Bob  Los Angeles               1
2        3         103       A         4  Charlie      Chicago               6
3        4         104       C         2    David      Houston               2
4        5         101       B         3    Alice     New York               4

In [139]:
filtered_orders = merged_df[merged_df['Product'].isin(['A', 'B'])]
print(filtered_orders)

   OrderID  CustomerID Product  Quantity     Name     Location  Total_Quantity
0        1         101       A         2    Alice     New York               2
1        2         102       B         1      Bob  Los Angeles               1
2        3         103       A         4  Charlie      Chicago               6
4        5         101       B         3    Alice     New York               4